code/todo/app/controllers/tasks_controller.rb

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def show
  # @id = params[:id]
   @task = Task.find(params[:id])

INSERT INTO "tasks" ("title", "details", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "dishes"], ["details", "do today "], ["created_at", "2019-02-19 15:46:13.446730"], ["updated_at", "2019-02-19 15:46:13.446730"]]
---
  def create
  @task = Task.create(task_params)

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @task = Task.find(params[:id])